<template>
  <section class="explain">
    <h4>选项“最近N天”用法：</h4>
    <p>
      开始时间 输入最近 N 天与当前日期的时间差，单位 天，整型数字，结束时间无需操作
      返回 N天前开始日期至当前时间范围，此值是左闭右开区间
      此选项范围是左闭右开区间
      如：当前日期20191107，输入3，则是 ’20191107’ > value >= ‘20191104’
    </p>

    <h4>选项“最近 M ～ N 天”用法：</h4>
    <p>
      开始时间 输入最近 M 天与当前日期的时间差，单位 天，整型数字
      结束时间 输入最近 N 天与当前日期的时间差，单位 天，整型数字
      返回 M天前开始日期至N天前开始日期范围，此值是左闭右开区间
      如：当前日期20191107，M输入17，N输入7，则是 ’2019-10-31’ > value >= ‘2019-10-21’
    </p>

    <h4>选项“历史截止当日”用法：</h4>
    <p>开始时间 输入历史开始日期，字符串，格式(yyyyMMdd, yyyy/MM/dd, yyyy-MM-dd)，结束时间无需操作
    返回 历史日期至当前日期范围，此值是左闭右开区间
    如：当前日期20191107，输入20191101，则是 ’20191107’ > value >= ‘20191101’</p>

    <h4>选项“自然周截止当日”用法：</h4>
    <p>开始/结束时间，无需输入
    返回 当前日期的自然周起始日期 至 当前日期范围，此值是左闭右开区间
    如：当前日期20191107，则是 ’20191107’ > value >= ‘20191104’</p>

    <h4>选项“自然月截止当日”用法：</h4>
    <p>开始/结束时间，无需输入
    返回 当前日期的自然月起始日期 至 当前日期范围，此值是左闭右开区间
    如：当前日期20191107，则是 ’20191107’ > value >= ‘20191101’</p>

    <h4>选项“自然年截止当日”用法：</h4>
    <p>开始/结束 时间，无需输入
    返回 当前日期的自然年起始日期 至 当前日期范围，此值是左闭右开区间
    如：当前日期20191107，则是 ’20191107’ > value >= ‘20191104’</p>

    <h4>选项“最近N周”用法：</h4>
    <p>开始时间 输入 N 个”周”期，单位 周，整型数字，结束时间无需操作
    返回N个周期之前起始日期范围，此值是左闭右开区间
    如：当前日期20191107，输入3，则是 ’20191107’ > value >= ‘20191017’</p>

    <h4>选项“自然月截止当日”用法：</h4>
    <p>开始时间 输入 N 个”月”周期，单位 月，整型数字，结束时间无需操作
    返回N个月之前起始日期范围，此值是左闭右开区间
    如：当前日期20191107，输入3，则是 ’20191107’ > value >= ‘20190807’</p>

    <h4>选项“固定日期”用法：</h4>
    <p>开始时间 输入开始日期，字符串，格式(yyyyMMdd, yyyy/MM/dd, yyyy-MM-dd)
    结束时间 输入结束日期，字符串，格式(yyyyMMdd, yyyy/MM/dd, yyyy-MM-dd)
    返回 开始日期 至 结束日期范围，此值是左闭右开区间
    如：当前日期20191107，M输入17，N输入7，则是 ’2019-10-31’ > value >= ‘2019-10-21’</p>
  </section>
</template>

<script>
export default {
  name: 'Explain'
}
</script>

<style lang="scss">
.explain {
  height: 250px;
  overflow-y: auto;
  padding: 15px;
  h4 {
    font-weight: 600;
    margin-top: 5px;
    margin-bottom: 5px;
  }
  p {
    font-size: 12px;
    text-indent: 2em;
    line-height: 18px;
    color: $grey5;
  }
}
</style>
